apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_userspace.c
  ASSERT(esp32s3_mmu_map_dbus(SOC_MMU_ACCESS_FLASH, MMU_BLOCK63_VADDR,
                              src_addr_aligned, page_count) == 0);

  esp32s3_dcache_resume(cache_state);

  return (void *)(MMU_BLOCK63_VADDR + (src_addr - src_addr_aligned));
}

/****************************************************************************
 * Name: load_header
 *
 * Description:
 *   Load metadata information from image header to enable the correct
 *   configuration of the Flash MMU and Cache and initialization of the
 *   code and data located in Internal RAM.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void load_header(void)
{
  size_t length = sizeof(struct user_image_load_header_s);
  const uint8_t *data =
    (const uint8_t *)map_flash(USER_IMAGE_OFFSET, length);

  DEBUGASSERT(data != NULL);

  memcpy(&g_header, data, length);
}

/****************************************************************************
 * Name: initialize_dram
 *
 * Description:
 *   Initialize data sections of the userspace image.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void initialize_dram(void)
{
  uint8_t *dest;
  uint8_t *end;

  /* Clear all of userspace .bss */

  ASSERT(USERSPACE->us_bssstart != 0 && USERSPACE->us_bssend != 0 &&
         USERSPACE->us_bssstart <= USERSPACE->us_bssend);

  dest = (uint8_t *)USERSPACE->us_bssstart;
  end  = (uint8_t *)USERSPACE->us_bssend;

  while (dest != end)
    {
      *dest++ = 0;
    }

  /* Initialize all of userspace .data */

  ASSERT(USERSPACE->us_datasource != 0 && USERSPACE->us_datastart != 0 &&
         USERSPACE->us_dataend != 0 &&
         USERSPACE->us_datastart <= USERSPACE->us_dataend);

  size_t length = USERSPACE->us_dataend - USERSPACE->us_datastart;
  const uint8_t *src =
    (const uint8_t *)map_flash(USER_IMAGE_OFFSET + USERSPACE->us_datasource,
                               length);

  ASSERT(src != NULL);

  dest = (uint8_t *)USERSPACE->us_datastart;
  end  = (uint8_t *)USERSPACE->us_dataend;

  while (dest != end)
    {
      *dest++ = *src++;
    }
}

/****************************************************************************
 * Name: initialize_iram
 *
 * Description:
 *   Initialize instruction sections of the userspace image.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void initialize_iram(void)
{
  uint32_t *dest;
  uint32_t *end;
  const uint32_t *src =
    (const uint32_t *)map_flash(USER_IMAGE_OFFSET + g_header.iram_lma,
                                g_header.iram_size);

  ASSERT(src != NULL);

  /* This routine will initialize the IRAM region located in Internal SRAM0,
   * which can be accessible using 32-bit loads and stores and if the source
   * and destiny addresses and length are 32-bit aligned.
   */

  dest = (uint32_t *)g_header.iram_vma;
  end  = (uint32_t *)g_header.iram_vma + g_header.iram_size;

  while (dest != end)
    {
      *dest++ = *src++;
    }
}

/****************************************************************************
 * Name: pms_violation_isr
 *
 * Description:
 *   This is the common PMS interrupt handler. It will be invoked the PMS
 *   detects an access violation.
 *
 * Parameters:
 *   cpuint        - CPU interrupt index
 *   context       - Context data from the ISR
 *   arg           - Opaque pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int IRAM_ATTR pms_violation_isr(int cpuint, void *context, void *arg)
{
  PANIC();

  return OK;
}

/****************************************************************************
 * Name: pms_enable_interrupts
 *
 * Description:
 *   Configure top level permission violation interrupts and set World
 *   Controller monitor registers.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void pms_enable_interrupts(void)
{
  /* We use two separate vector tables for WORLD0 and WORLD1,
   * this allows us to handle Windowed exceptions in WORLD1 itself, thus
   * saving CPU cycles.
   * For other vectors, we jump to WORLD0 vector table from WORLD1 vector
   * table.
   * The vector table for WORLD1 is placed right at the start of WORLD1 IRAM.
   */

  esp32s3_wcl_set_vecbase(PMS_WORLD_0, VECTORS_START);
  esp32s3_wcl_set_vecbase(PMS_WORLD_1, UIRAM_START);

  extern void _user_exception_vector(void);
  esp32s3_wcl_set_world0_entry(1, (uintptr_t)_user_exception_vector);
  extern void _xtensa_level3_vector(void);
  esp32s3_wcl_set_world0_entry(2, (uintptr_t)_xtensa_level3_vector);

  /* Enable IRAM0 permission violation interrupt */

  modifyreg32(SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_CLR_M,
              SENSITIVE_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_EN);

  /* Enable DRAM0 permission violation interrupt */

  modifyreg32(SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_CLR_M,
              SENSITIVE_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_EN);

  /* Enable Flash Instruction Cache permission violation interrupt */

  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG,
              EXTMEM_CORE0_IBUS_REJECT_INT_CLR_M,
              0);
  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG,
              EXTMEM_CORE0_IBUS_REJECT_INT_ENA_M,
              EXTMEM_CORE0_IBUS_REJECT_INT_ENA);

  /* Enable Flash Data Cache permission violation interrupt */

  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_CLR_REG,
              EXTMEM_CORE0_DBUS_REJECT_INT_CLR_M,
              0);
  modifyreg32(EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG,
              EXTMEM_CORE0_DBUS_REJECT_INT_ENA_M,
              EXTMEM_CORE0_DBUS_REJECT_INT_ENA);

