apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_userspace.c
  /* Enable Flash Data Cache permission violation interrupt */

  modifyreg32(SENSITIVE_CORE_0_PIF_PMS_MONITOR_1_REG,
              SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_CLR_M,
              SENSITIVE_CORE_0_PIF_PMS_MONITOR_VIOLATE_EN);
}

/****************************************************************************
 * Name: pms_configure_iram_access
 *
 * Description:
 *   Configure the access permissions to the IRAM region.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void pms_configure_iram_access(void)
{
  /* Kernel permission to the Instruction Cache */

  esp32s3_pms_configure_icache(PMS_AREA_0, PMS_WORLD_0, PMS_ACCESS_ALL);
  esp32s3_pms_configure_icache(PMS_AREA_1, PMS_WORLD_0, PMS_ACCESS_ALL);

  /* User permission to the Instruction Cache */

  esp32s3_pms_configure_icache(PMS_AREA_0, PMS_WORLD_1, PMS_ACCESS_NONE);
#ifdef CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB
  /* In case the Instruction Cache size is configured to 16KB, the other 16KB
   * block from Internal SRAM0 (Block1) will be used as IRAM.
   */

  esp32s3_pms_configure_icache(PMS_AREA_1, PMS_WORLD_1, PMS_ACCESS_ALL);
#else /* CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB */
  /* In case the Instruction Cache size is configured to 32KB, the WORLD1
   * access permissions to the Internal SRAM0 must be revoked.
   */

  esp32s3_pms_configure_icache(PMS_AREA_1, PMS_WORLD_1, PMS_ACCESS_NONE);
#endif

  /* Set split lines to partition the IRAM into regions */

  esp32s3_pms_set_iram_split_line(PMS_SPLIT_LINE_0, UIRAM_END);
  esp32s3_pms_set_iram_split_line(PMS_SPLIT_LINE_1, KIRAM_END);

  /* Configure Kernel access permissions to each split region */

  esp32s3_pms_configure_iram_region(PMS_AREA_0, PMS_WORLD_0, PMS_ACCESS_ALL);
  esp32s3_pms_configure_iram_region(PMS_AREA_1, PMS_WORLD_0, PMS_ACCESS_ALL);
  esp32s3_pms_configure_iram_region(PMS_AREA_2, PMS_WORLD_0, PMS_ACCESS_ALL);

  /* Configure User access permissions to each split region */

#ifdef CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB
  /* In case the Instruction Cache size is configured to 16KB, the IRAM
   * allocation to WORLD1 will be entirely restricted to Internal SRAM0, so
   * we can safely revoke permissions to the shared Internal SRAM1.
   */

  esp32s3_pms_configure_iram_region(PMS_AREA_0, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
#else /* CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB */
  /* In case the Instruction Cache size is configured to 32KB, the first
   * block from the shared Internal SRAM1 (Block2) will be allocated to
   * WORLD1.
   */

  esp32s3_pms_configure_iram_region(PMS_AREA_0, PMS_WORLD_1, PMS_ACCESS_ALL);
#endif
  esp32s3_pms_configure_iram_region(PMS_AREA_1, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_iram_region(PMS_AREA_2, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);

  /* PMS_AREA_3 corresponds to the region after the main split line,
   * i.e. the entire DRAM.
   */

  esp32s3_pms_configure_iram_region(PMS_AREA_3, PMS_WORLD_0,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_iram_region(PMS_AREA_3, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
}

/****************************************************************************
 * Name: pms_configure_dram_access
 *
 * Description:
 *   Configure the access permissions to the DRAM region.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void pms_configure_dram_access(void)
{
  /* Kernel permission to the Data Cache */

  esp32s3_pms_configure_dcache(PMS_WORLD_0, PMS_ACCESS_ALL);

  /* User permission to the Data Cache */

  esp32s3_pms_configure_dcache(PMS_WORLD_1, PMS_ACCESS_NONE);

  /* Split line to protect DRAM area reserved for ROM functions.
   * ALIGN_DOWN macro is used to align the address to 256 bit boundary.
   */

  uintptr_t rom_reserve_aligned =
    ALIGN_DOWN(ets_rom_layout_p->dram0_rtos_reserved_start, 256);

  /* Set split lines to partition the DRAM into regions */

  esp32s3_pms_set_dram_split_line(PMS_SPLIT_LINE_0, UDRAM_START);
  esp32s3_pms_set_dram_split_line(PMS_SPLIT_LINE_1, rom_reserve_aligned);

  /* PMS_AREA_0 corresponds to the region before the main split line,
   * i.e entire IRAM.
   */

  esp32s3_pms_configure_dram_region(PMS_AREA_0, PMS_WORLD_0,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_dram_region(PMS_AREA_0, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);

  /* Configure Kernel access permissions to each split region */

  esp32s3_pms_configure_dram_region(PMS_AREA_1, PMS_WORLD_0, PMS_ACCESS_ALL);
  esp32s3_pms_configure_dram_region(PMS_AREA_2, PMS_WORLD_0, PMS_ACCESS_ALL);
  esp32s3_pms_configure_dram_region(PMS_AREA_3, PMS_WORLD_0, PMS_ACCESS_ALL);

  /* Configure User access permissions to each split region */

  esp32s3_pms_configure_dram_region(PMS_AREA_1, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
  esp32s3_pms_configure_dram_region(PMS_AREA_2, PMS_WORLD_1, PMS_ACCESS_ALL);
  esp32s3_pms_configure_dram_region(PMS_AREA_3, PMS_WORLD_1,
                                    PMS_ACCESS_NONE);
}

/****************************************************************************
 * Name: pms_configure_flash_cache_access
 *
 * Description:
 *   Configure the access permissions to the region dedicated to the
 *   Instruction and Data Caches.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static IRAM_ATTR void pms_configure_flash_cache_access(void)
{
  /* Invalidate Cache */

  uint32_t cache_state = esp32s3_dcache_suspend(true);
  esp32s3_icache_invalidate_all();

  size_t partition_offset = USER_IMAGE_OFFSET;

  /* Total image size must be aligned to the MMU page size (64 KB) to match
   * the required granularity of the PMS split regions for the External
   * Flash.
   * IROM region offset in External Flash plus its size provides an accurate
   * estimate about the User Image size.
   */

