apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_userspace.c
static void configure_mpu(void)
{
  /* Configure interrupts for permission violation */

  pms_enable_interrupts();

  /* Define the Internal SRAM1 regions for code and data by configuring the
   * split lines.
   */

  esp32s3_pms_set_sram_main_split_line(KIRAM_END);

  /* Configure Kernel and Userspace permissions for accessing the internal
   * memories.
   */

  /* IROM */

  esp32s3_pms_configure_irom_access();

  /* DROM */

  esp32s3_pms_configure_drom_access();

  /* IRAM */

  pms_configure_iram_access();

  /* DRAM */

  pms_configure_dram_access();

  /* Instruction and Data Caches */

  pms_configure_flash_cache_access();

  /* Configure Kernel and Userspace permissions for accessing the chip's
   * peripherals.
   */

  pms_configure_peripheral_access();
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_userspace
 *
 * Description:
 *   For the case of the separate user/kernel space build, perform whatever
 *   platform specific initialization of the user memory is required.
 *   Normally this just means initializing the userspace .data and .bss
 *   segments.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32s3_userspace(void)
{
  /* Load metadata information from image header */

  load_header();

  /* Configure the Flash MMU for enabling access to the userspace image */

  configure_flash_mmu();

  /* Initialize userspace DRAM */

  initialize_dram();

  /* Initialize userspace IRAM */

  initialize_iram();

  /* Configure MPU to grant access to the userspace */

  configure_mpu();
}

/****************************************************************************
 * Name: esp32s3_pmsirqinitialize
 *
 * Description:
 *   Initialize interrupt handler for the PMS violation ISR.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32s3_pmsirqinitialize(void)
{
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_IRAM0_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_DRAM0_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CACHE_CORE0_ACS,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));
  VERIFY(esp_setup_irq(ESP32S3_PERIPH_CORE_0_PIF_PMS_MONITOR_VIOLATE,
                       1, ESP_IRQ_TRIGGER_LEVEL, pms_violation_isr, NULL));

  up_enable_irq(ESP32S3_IRQ_CORE_0_IRAM0_PMS_MONITOR_VIOLATE);
  up_enable_irq(ESP32S3_IRQ_CORE_0_DRAM0_PMS_MONITOR_VIOLATE);
  up_enable_irq(ESP32S3_IRQ_CACHE_CORE0_ACS);
  up_enable_irq(ESP32S3_IRQ_CORE_0_PIF_PMS_MONITOR_VIOLATE);
}

#endif /* CONFIG_BUILD_PROTECTED */
